---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures
source: html/7cf86d0a-85aa-b09e-5378-36e02948233b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures

Failures about AutoRoute.

## Syntax (C#)
```csharp
public static class AutoRouteFailures
```